{"fetch_admin_module_data":[{"id":1,"module_tabs_json":[{"id":1,"title":"Dropdown","content":"<p>Add a dropdown list to any button. Make sure that the&nbsp;<code>data-target<\/code>&nbsp;attribute matches the id in the&nbsp;<code>&lt;ul&gt;<\/code>&nbsp;tag. You can add a divider with the&nbsp;<code>&lt;li class=\"divider\"&gt;&lt;\/li&gt;<\/code>&nbsp;tag. You can also add icons. Just add the icon inside the&nbsp;<code>anchor<\/code>&nbsp;tag.<\/p>\r\n<h5>Help Materialize Grow<\/h5>\r\n<p>We hope you have enjoyed using Materialize and if you feel like it has helped you out and want to support the team you can help us by donating or backing us on Patreon. Any amount would help support and continue development on this project and is greatly appreciated.<\/p>\r\n<h5>Join the Discussion<\/h5>\r\n<p>We have a Gitter chat room set up where you can talk directly with us. Come in and discuss new features, future goals, general problems or questions, or anything else you can think of.<\/p>\r\n<p>Provide value and encourage return visits by introducing users to new features and functionality at contextually relevant moments.<\/p>\r\n<p>Feature discovery prompts have more impact when they are presented to the right users at contextually relevant moments. When presented to the wrong user at the wrong time, they can be intrusive and annoying.<\/p>","module_id":1,"is_comments_allowed":1,"cache_posts_count":3},{"id":2,"title":"Parallax","content":"<p>Parallax is an effect where the background content or image in this case, is moved at a different speed than the foreground content while scrolling. Check out the demo to get a better idea of it.<\/p>","module_id":1,"is_comments_allowed":0,"cache_posts_count":0},{"id":3,"title":"Sidenav","content":"<p>This is a slide out menu. You can add a dropdown to your sidebar by using our collapsible component. If you want to see a demo, our sidebar will use this on smaller screens. To use this in conjunction with a fullscreen navigation, you have to use two copies of the same UL.<\/p>","module_id":1,"is_comments_allowed":0,"cache_posts_count":0}]},{"id":2456685288,"module_tabs_json":[{"id":1719232030,"title":"Toasts","content":"<p>Materialize provides an easy way for you to send unobtrusive alerts to your users through toasts. These toasts are also placed and sized responsively, try it out by clicking the button below on different device sizes.<\/p><p>You can pass in an HTML String as the first argument as well. Take a look at the example below, where we pass in text as well as a flat button. If you call an external function instead of in-line JavaScript, you will not need to escape quotation marks.<\/p><p><a><\/a><\/p>","module_id":2456685288,"is_comments_allowed":0,"cache_posts_count":0}]},{"id":1960607215,"module_tabs_json":[{"id":3479417397,"title":"Carousel","content":"<p>Our Carousel is a robust and versatile component that can be an image slider, to an item carousel, to an onboarding experience. It is touch enabled making it especially smooth to use on mobile.<\/p>\r\n<p>Note: This is also touch compatible! Try swiping with your finger to scroll through the carousel.<\/p>","module_id":1960607215,"is_comments_allowed":0,"cache_posts_count":0}]}]}