{"fetch_admin_module_data":[{"id":1,"module_tabs_json":[{"id":1,"title":"Red Panda","content":"<p>Village 88 Inc. is a US-Delaware corporation which focuses on incubating companies and providing IT consultancy services to companies in the US. V88 also has a remote branch in San Fernando, La Union, Philippines registered in Securities and Exchange Commission as 457Avenue Inc.<\/p>","module_id":1,"is_comments_allowed":0},{"id":2,"title":"HG Model Kit","content":"<p>$views_path is specified for this file in order for the partial be loaded from FE and BE side<\/p>","module_id":1,"is_comments_allowed":0},{"id":3,"title":"Sample Tab 3","content":"<p>$views_path is specified for this file in order for the partial be loaded from FE and BE side<\/p>","module_id":1,"is_comments_allowed":0}]},{"id":3620940617,"module_tabs_json":[{"id":2451814602,"title":"Tab 2451814602 Module 3620940617","content":"<p>I can’t believe nobody is talking about how incredible it is they have a whole 2 hour documentary already out just a few days after all these banks failed. I bet they were working on this before all that happened (I’m not sure I just started watching right now), but even if that’s the case the fact they were able to rush to include the stuff about the banks failing is incredible. Everyone who worked on this deserves a raise<\/p>","module_id":3620940617,"is_comments_allowed":0}]},{"id":2513561841,"module_tabs_json":[{"id":2191949363,"title":"Tab 2191949363 Module 2513561841","content":"<p>In 2008 I worked for the law firm that brought down Lehman Brothers. I so wish I had a time machine to see exactly what that meant at the time.  The next year, I lost: my savings (I worked my lifetime for that), my tiny home, my job through downsizing, and my boyfriend left. Hundreds of people at my firm lost their jobs. I had a nervous breakdown. I took out my remaining money and put it into a credit union. The life I thought I was going to have in retirement went down the drain. I found out I am stronger than I could ever imagine.<\/p>","module_id":2513561841,"is_comments_allowed":0}]}]}